stress_cs_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="3.2" jmeter="3.3 r1808647">
  <hashTree>
    <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
      <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
        <boolProp name="LoopController.continue_forever">false</boolProp>
        <stringProp name="LoopController.loops">100</stringProp>
      </elementProp>
      <stringProp name="ThreadGroup.num_threads">10</stringProp>
      <stringProp name="ThreadGroup.ramp_time">2</stringProp>
      <longProp name="ThreadGroup.start_time">1211836504000</longProp>
      <longProp name="ThreadGroup.end_time">1211836504000</longProp>
      <boolProp name="ThreadGroup.scheduler">false</boolProp>
      <stringProp name="ThreadGroup.on_sample_error">stoptest</stringProp>
    </ThreadGroup>
    <hashTree>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/soap+xml;charset=UTF-8</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
        <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
          <collectionProp name="Arguments.arguments">
            <elementProp name="" elementType="HTTPArgument">
              <boolProp name="HTTPArgument.always_encode">false</boolProp>
              <stringProp name="Argument.value">&lt;soap:Envelope xmlns:soap=&quot;http://www.w3.org/2003/05/soap-envelope&quot; xmlns:api=&quot;http://api.decidir.com.ar&quot;&gt;&#xd;
   &lt;soap:Header/&gt;&#xd;
   &lt;soap:Body&gt;&#xd;
      &lt;api:Execute&gt;&#xd;
         &lt;api:Security&gt;&lt;/api:Security&gt;&#xd;
         &lt;!--Optional:--&gt;&#xd;
         &lt;api:Session&gt;&lt;/api:Session&gt;&#xd;
         &lt;api:Merchant&gt;00201114&lt;/api:Merchant&gt;&#xd;
         &lt;api:Operation&gt;Execute&lt;/api:Operation&gt;&#xd;
         &lt;!--Optional:--&gt;&#xd;
         &lt;api:EncodingMethod&gt;XML&lt;/api:EncodingMethod&gt;&#xd;
         &lt;!--Optional:--&gt;&#xd;
         &lt;api:Payload&gt;&#xd;
            &lt;Request&gt;&#xd;
               &lt;NROCOMERCIO&gt;00201114&lt;/NROCOMERCIO&gt;&#xd;
               &lt;NROOPERACION&gt;dami_${__time(,curTime)}&lt;/NROOPERACION&gt;&#xd;
               &lt;MEDIODEPAGO&gt;1&lt;/MEDIODEPAGO&gt;&#xd;
               &lt;MONTO&gt;1000&lt;/MONTO&gt;&#xd;
               &lt;MONEDA&gt;032&lt;/MONEDA&gt;&#xd;
               &lt;CUOTAS&gt;01&lt;/CUOTAS&gt;&#xd;
               &lt;EMAILCLIENTE&gt;reject@decidir.com&lt;/EMAILCLIENTE&gt;&#xd;
               &lt;TIPODOC&gt;1&lt;/TIPODOC&gt;&#xd;
               &lt;NRODOC&gt;1213211654&lt;/NRODOC&gt;&#xd;
               &lt;CALLE/&gt;&#xd;
               &lt;NROPUERTA/&gt;&#xd;
               &lt;NOMBREENTARJETA&gt;testr&lt;/NOMBREENTARJETA&gt;&#xd;
               &lt;NROTARJETA&gt;4507990000004905&lt;/NROTARJETA&gt;&#xd;
               &lt;VENTARJETA&gt;1808&lt;/VENTARJETA&gt;&#xd;
               &lt;VENCIMIENTO&gt;1808&lt;/VENCIMIENTO&gt;&#xd;
               &lt;CODSEGURIDAD&gt;775&lt;/CODSEGURIDAD&gt;&#xd;
               &lt;NOMBRE/&gt;&#xd;
               &lt;APELLIDO/&gt;&#xd;
               &lt;TELEFONO/&gt;&#xd;
               &lt;FECHANACIMIENTO/&gt;&#xd;
               &lt;CANTDIASFECHAVENC&gt;0&lt;/CANTDIASFECHAVENC&gt;&#xd;
               &lt;CANTDIASPAGO/&gt;&#xd;
               &lt;RECARGO/&gt;&#xd;
               &lt;FECHAVTO/&gt;&#xd;
               &lt;FECHAVTO2/&gt;&#xd;
               &lt;CLIENTE/&gt;&#xd;
               &lt;IDTEMPLATES/&gt;&#xd;
               &lt;TITULAR/&gt;&#xd;
               &lt;AIDCOMERCIO&gt;COMERCIOTEST&lt;/AIDCOMERCIO&gt;&#xd;
               &lt;CSBTCITY&gt;Bs As&lt;/CSBTCITY&gt;&#xd;
               &lt;CSBTCOUNTRY&gt;AR&lt;/CSBTCOUNTRY&gt;&#xd;
               &lt;CSBTCUSTOMERID&gt;5&lt;/CSBTCUSTOMERID&gt;&#xd;
               &lt;CSBTIPADDRESS&gt;10.2.73.163&lt;/CSBTIPADDRESS&gt;&#xd;
               &lt;CSBTEMAIL&gt;reject@decidir.com&lt;/CSBTEMAIL&gt;&#xd;
               &lt;CSBTFIRSTNAME&gt;dammian ariel&lt;/CSBTFIRSTNAME&gt;&#xd;
               &lt;CSBTLASTNAME&gt;Wajser &amp;amp;Ntilde;o&amp;amp;ntilde;o&lt;/CSBTLASTNAME&gt;&#xd;
               &lt;CSBTPHONENUMBER&gt;49210465&lt;/CSBTPHONENUMBER&gt;&#xd;
               &lt;CSBTPOSTALCODE&gt;1212&lt;/CSBTPOSTALCODE&gt;&#xd;
               &lt;CSBTSTATE&gt;B&lt;/CSBTSTATE&gt;&#xd;
               &lt;CSBTSTREET1&gt;l&amp;amp;ntilde;ala 12 5&lt;/CSBTSTREET1&gt;&#xd;
               &lt;CSBTSTREET2/&gt;&#xd;
               &lt;CSPTCURRENCY&gt;ARS&lt;/CSPTCURRENCY&gt;&#xd;
               &lt;CSPTGRANDTOTALAMOUNT&gt;54.99&lt;/CSPTGRANDTOTALAMOUNT&gt;&#xd;
               &lt;CSMDD7&gt;0&lt;/CSMDD7&gt;&#xd;
               &lt;CSMDD8/&gt;&#xd;
               &lt;CSMDD9/&gt;&#xd;
               &lt;CSMDD10/&gt;&#xd;
               &lt;CSMDD11&gt;49210465&lt;/CSMDD11&gt;&#xd;
               &lt;CSSTCITY&gt;Bs as&lt;/CSSTCITY&gt;&#xd;
               &lt;CSSTCOUNTRY&gt;AR&lt;/CSSTCOUNTRY&gt;&#xd;
               &lt;CSSTEMAIL&gt;reject@decidir.com&lt;/CSSTEMAIL&gt;&#xd;
               &lt;CSSTFIRSTNAME&gt;dammian ariel&lt;/CSSTFIRSTNAME&gt;&#xd;
               &lt;CSSTLASTNAME&gt;Wajser &amp;amp;Ntilde;o&amp;amp;ntilde;o&lt;/CSSTLASTNAME&gt;&#xd;
               &lt;CSSTPHONENUMBER&gt;49210465&lt;/CSSTPHONENUMBER&gt;&#xd;
               &lt;CSSTPOSTALCODE&gt;1212&lt;/CSSTPOSTALCODE&gt;&#xd;
               &lt;CSSTSTATE&gt;B&lt;/CSSTSTATE&gt;&#xd;
               &lt;CSSTSTREET1&gt;l&amp;amp;ntilde;ala 12 5&lt;/CSSTSTREET1&gt;&#xd;
               &lt;CSMDD12&gt;6&lt;/CSMDD12&gt;&#xd;
               &lt;CSMDD13&gt;Flat Rate - Fixed&lt;/CSMDD13&gt;&#xd;
               &lt;CSMDD14/&gt;&#xd;
               &lt;CSMDD15/&gt;&#xd;
               &lt;CSMDD16/&gt;&#xd;
               &lt;CSITPRODUCTCODE&gt;default&lt;/CSITPRODUCTCODE&gt;&#xd;
               &lt;CSITPRODUCTDESCRIPTION&gt;El coso&lt;/CSITPRODUCTDESCRIPTION&gt;&#xd;
               &lt;CSITPRODUCTNAME&gt;Venta de coso&lt;/CSITPRODUCTNAME&gt;&#xd;
               &lt;CSITPRODUCTSKU&gt;32742&lt;/CSITPRODUCTSKU&gt;&#xd;
               &lt;CSITTOTALAMOUNT&gt;49.99&lt;/CSITTOTALAMOUNT&gt;&#xd;
               &lt;CSITQUANTITY&gt;1&lt;/CSITQUANTITY&gt;&#xd;
               &lt;CSITUNITPRICE&gt;49.99&lt;/CSITUNITPRICE&gt;&#xd;
               &lt;CSMDD80/&gt;&#xd;
               &lt;CSMDD81/&gt;&#xd;
               &lt;CSMDD82/&gt;&#xd;
               &lt;CSMDD83/&gt;&#xd;
               &lt;CSMDD84/&gt;&#xd;
               &lt;CSMDD85/&gt;&#xd;
               &lt;CSMDD3/&gt;&#xd;
               &lt;CSMDD43&gt;sarasa&lt;/CSMDD43&gt;&#xd;
               &lt;CSMDD45&gt;val4555&lt;/CSMDD45&gt;&#xd;
               &lt;CSMDD46&gt;val46&lt;/CSMDD46&gt;&#xd;
               &lt;CSMDD47&gt;val47&lt;/CSMDD47&gt;&#xd;
               &lt;CSDEVICEFINGERPRINTID&gt;f38f610b-f6c3-85d2-052a-8f046feb5d3e&lt;/CSDEVICEFINGERPRINTID&gt;&#xd;
               &lt;CSMDD6&gt;Telefonic&lt;/CSMDD6&gt;&#xd;
            &lt;/Request&gt;&#xd;
         &lt;/api:Payload&gt;&#xd;
      &lt;/api:Execute&gt;&#xd;
   &lt;/soap:Body&gt;&#xd;
&lt;/soap:Envelope&gt;</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
          </collectionProp>
        </elementProp>
        <stringProp name="HTTPSampler.domain">138.121.79.61</stringProp>
        <stringProp name="HTTPSampler.port">8443</stringProp>
        <stringProp name="HTTPSampler.protocol">https</stringProp>
        <stringProp name="HTTPSampler.path">/services/t/decidir.net/Authorize.AuthorizeHttpsSoap12Endpoint</stringProp>
        <stringProp name="HTTPSampler.method">POST</stringProp>
        <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
        <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
        <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        <stringProp name="HTTPSampler.implementation">Java</stringProp>
      </HTTPSamplerProxy>
      <hashTree/>
      <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="File Reporter" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">/home/damian/Documents/pigmalion/headers.jmx</stringProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>